# Arizona State University - Active Perception Group

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0
   [-1, 1, Conv, [128, 3, 2]],    # 1
   [-1, 3, C3, [128]],            # 2
   [-1, 1, Conv, [256, 3, 2]],    # 3
   [-1, 6, C3, [256]],            # 4    
   [-1, 1, Conv, [512, 3, 2]],    # 5    
   [-1, 9, C3, [512]],            # 6
   [-1, 1, Conv, [1024, 3, 2]],   # 7
   [-1, 3, C3, [1024]],           # 8
   [-1, 1, SPPF, [1024, 5]],      # 9
  ]


# YOLOv5 v6.0 head
head:
  [[-1, 1, ShiftChannel, [256]],                        # 10
   [-1, 1, Conv, [512, 1, 1]],                          # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],          # 12
   [ 6, 1, ShiftChannel, [128]],                        # 13
   [[-1, -2], 1, Concat, [1]],  # cat backbone P4       # 14
   [-1, 3, C3, [512, False]],                           # 15

   [-1, 1, Conv, [256, 1, 1]],                          # 16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],          # 17
   [ 4, 1, ShiftChannel, [64]],                         # 18
   [[-1, -2], 1, Concat, [1]],  # cat backbone P3       # 19
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)        # 20

   [-1, 1, Conv, [256, 3, 2]],                          # 21
   [16, 1, ControlChannel, [64]],                       # 22
   [[-1, -2], 1, Concat, [1]],  # cat head P4           # 23
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)      # 24

   [-1, 1, Conv, [512, 3, 2]],                          # 25
   [11, 1, ControlChannel, [128]],                      # 26
   [[-1, -2], 1, Concat, [1]],  # cat head P5           # 27
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)      # 28
    # Detect(P3, P4, P5)
   [[20, 24, 28], 1, Detect, [nc, anchors]],            # 29
  ]
